Revit 2026 API

# ControlShape Enumeration

---

An enumerated type listing four shapes of control that Autodesk Revit supports.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ControlShape
```
```vb
Public Enumeration ControlShape
```
```cpp
public enum class ControlShape
```
```fsharp
type ControlShape
```

| Member name | Value | Description |
| --- | --- | --- |
| DoubleHorizontalArrow | 3 | Double horizontal arrow. |
| DoubleVerticalArrow | 2 | Double vertical arrow. |
| HorizontalArrow | 1 | Horizontal arrow. |
| VerticalArrow | 0 | Vertical arrow. |

#### Reference

Autodesk.Revit.DB Namespace